<html>

<head>
<title>Fundamentos de GIT</title>
</head>

<body>
<h1>Fundamentos de Git</h1>
<p>Entonces, ¿qu&eacute; es Git en pocas palabras? Es muy importante asimilar esta secci&oacute;n, porque si entiendes lo que es Git y los fundamentos de c&oacute;mo funciona, probablemente te sea mucho m&aacute;s f&aacute;cil usar Git de manera eficaz. A medida que aprendas Git, intenta olvidar todo lo que puedas saber sobre otros VCSs, como Subversion y Perforce; hacerlo te ayudar&aacute; a evitar confusiones sutiles a la hora de utilizar la herramienta. Git almacena y modela la informaci&oacute;n de forma muy diferente a esos otros sistemas, a pesar de que su interfaz sea bastante similar; comprender esas diferencias evitar&aacute; que te confundas a la hora de usarlo.</p>

<h2>Instant&aacute;neas, no diferencias</h2>
<p>La principal diferencia entre Git y cualquier otro VCS (Subversion y compañ&iacute;a incluidos) es c&oacute;mo Git modela sus datos. Conceptualmente, la mayor&iacute;a de los dem&aacute;s sistemas almacenan la informaci&oacute;n como una lista de cambios en los archivos. Estos sistemas (CVS, Subversion, Perforce, Bazaar, etc.) modelan la informaci&oacute;n que almacenan como un conjunto de archivos y las modificaciones hechas sobre cada uno de ellos a lo largo del tiempo, como ilustra la Figura 1-4.</p>
<img src="imagenes/foto1.png">

<p>Git no modela ni almacena sus datos de este modo. En cambio, Git modela sus datos m&aacute;s como un conjunto de instant&aacute;neas de un mini sistema de archivos. Cada vez que confirmas un cambio, o guardas el estado de tu proyecto en Git, &eacute;l b&aacute;sicamente hace una foto del aspecto de todos tus archivos en ese momento, y guarda una referencia a esa instant&aacute;nea. Para ser eficiente, si los archivos no se han modificado, Git no almacena el archivo de nuevo, s&oacute;lo un enlace al archivo anterior id&eacute;ntico que ya tiene almacenado. Git modela sus datos m&aacute;s como en la Figura 1-5.</p>
<img src="imagenes/foto2.png">
<p>Esta es una distinci&oacute;n importante entre Git y pr&aacute;cticamente todos los dem&aacute;s VCSs. Hace que Git reconsidere casi todos los aspectos del control de versiones que muchos de los dem&aacute;s sistemas copiaron de la generaci&oacute;n anterior. Esto hace que Git se parezca m&aacute;s a un mini sistema de archivos con algunas herramientas tremendamente potentes construidas sobre &eacute;l, que a un VCS. Exploraremos algunos de los beneficios que obtienes al modelar tus datos de esta manera cuando veamos ramificaciones (branching) en Git en el Cap&iacute;tulo 3.</p>

<h2>Casi cualquier operaci&oacute;n es local</h2>
<p>La mayor&iacute;a de las operaciones en Git s&oacute;lo necesitan archivos y recursos locales para operar. Por lo general no se necesita informaci&oacute;n de ningún otro ordenador de tu red. Si est&aacute;s acostumbrado a un CVCS donde la mayor&iacute;a de las operaciones tienen esa sobrecarga del retardo de la red, este aspecto de Git te va a hacer pensar que los dioses de la velocidad han bendecido Git con poderes sobrenaturales. Como tienes toda la historia del proyecto ah&iacute; mismo, en tu disco local, la mayor&iacute;a de las operaciones parecen pr&aacute;cticamente inmediatas.</p>

<p>Por ejemplo, para navegar por la historia del proyecto, Git no necesita salir al servidor para obtener la historia y mostr&aacute;rtela, simplemente la lee directamente de tu base de datos local. Esto significa que ves la historia del proyecto casi al instante. Si quieres ver los cambios introducidos en un archivo entre la versi&oacute;n actual y la de hace un mes, Git puede buscar el archivo hace un mes y hacer un c&aacute;lculo de diferencias localmente, en lugar de tener que pedirle a un servidor remoto que lo haga, u obtener una versi&oacute;n antigua desde la red y hacerlo de manera local.</p>

<p>Esto tambi&eacute;n significa que hay muy poco que no puedas hacer si est&aacute;s desconectado o sin VPN. Si te subes a un avi&oacute;n o a un tren y quieres trabajar un poco, puedes confirmar tus cambios felizmente hasta que consigas una conexi&oacute;n de red para subirlos. Si te vas a casa y no consigues que tu cliente VPN funcione correctamente, puedes seguir trabajando. En muchos otros sistemas, esto es imposible o muy doloroso. En Perforce, por ejemplo, no puedes hacer mucho cuando no est&aacute;s conectado al servidor; y en Subversion y CVS, puedes editar archivos, pero no puedes confirmar los cambios a tu base de datos (porque tu base de datos no tiene conexi&oacute;n). Esto puede no parecer gran cosa, pero te sorprender&iacute;a la diferencia que puede suponer.</p>

<h2>Git tiene integridad</h2>
<p>Todo en Git es verificado mediante una suma de comprobaci&oacute;n (checksum en ingl&eacute;s) antes de ser almacenado, y es identificado a partir de ese momento mediante dicha suma. Esto significa que es imposible cambiar los contenidos de cualquier archivo o directorio sin que Git lo sepa. Esta funcionalidad est&aacute; integrada en Git al m&aacute;s bajo nivel y es parte integral de su filosof&iacute;a. No puedes perder informaci&oacute;n durante su transmisi&oacute;n o sufrir corrupci&oacute;n de archivos sin que Git lo detecte.</p>

<p>El mecanismo que usa Git para generar esta suma de comprobaci&oacute;n se conoce como hash SHA-1. Se trata de una cadena de 40 caracteres hexadecimales (0-9 y a-f), y se calcula en base a los contenidos del archivo o estructura de directorios. Un hash SHA-1 tiene esta pinta:</p>

<p>Ver&aacute;s estos valores hash por todos lados en Git, ya que los usa con mucha frecuencia. De hecho, Git guarda todo no por nombre de archivo, sino por el valor hash de sus contenidos.</p>

<h2>Git generalmente s&oacute;lo añade informaci&oacute;n</h2>
<p>Cuando realizas acciones en Git, casi todas ellas s&oacute;lo añaden informaci&oacute;n a la base de datos de Git. Es muy dif&iacute;cil conseguir que el sistema haga algo que no se pueda deshacer, o que de algún modo borre informaci&oacute;n. Como en cualquier VCS, puedes perder o estropear cambios que no has confirmado todav&iacute;a; pero despu&eacute;s de confirmar una instant&aacute;nea en Git, es muy dif&iacute;cil de perder, especialmente si env&iacute;as (push) tu base de datos a otro repositorio con regularidad.</p>

<p>Esto hace que usar Git sea un placer, porque sabemos que podemos experimentar sin peligro de fastidiar gravemente las cosas. Para un an&aacute;lisis m&aacute;s exhaustivo de c&oacute;mo almacena Git su informaci&oacute;n y c&oacute;mo puedes recuperar datos aparentemente perdidos, ver Cap&iacute;tulo 9.</p>

<h2>Los tres estados</h2>
<p>Ahora presta atenci&oacute;n. Esto es lo m&aacute;s importante a recordar acerca de Git si quieres que el resto de tu proceso de aprendizaje prosiga sin problemas. Git tiene tres estados principales en los que se pueden encontrar tus archivos: confirmado (committed), modificado (modified), y preparado (staged). Confirmado significa que los datos est&aacute;n almacenados de manera segura en tu base de datos local. Modificado significa que has modificado el archivo pero todav&iacute;a no lo has confirmado a tu base de datos. Preparado significa que has marcado un archivo modificado en su versi&oacute;n actual para que vaya en tu pr&oacute;xima confirmaci&oacute;n.</p>

<p>Esto nos lleva a las tres secciones principales de un proyecto de Git: el directorio de Git (Git directory), el directorio de trabajo (working directory), y el &aacute;rea de preparaci&oacute;n (staging area).</p>
<img src="imagenes/foto3.png">

<p>El directorio de Git es donde Git almacena los metadatos y la base de datos de objetos para tu proyecto. Es la parte m&aacute;s importante de Git, y es lo que se copia cuando clonas un repositorio desde otro ordenador.</p>

<p>El directorio de trabajo es una copia de una versi&oacute;n del proyecto. Estos archivos se sacan de la base de datos comprimida en el directorio de Git, y se colocan en disco para que los puedas usar o modificar.</p>

<p>El &aacute;rea de preparaci&oacute;n es un sencillo archivo, generalmente contenido en tu directorio de Git, que almacena informaci&oacute;n acerca de lo que va a ir en tu pr&oacute;xima confirmaci&oacute;n. A veces se le denomina &iacute;ndice, pero se est&aacute; convirtiendo en est&aacute;ndar el referirse a ella como el &aacute;rea de preparaci&oacute;n.</p>

<p>El flujo de trabajo b&aacute;sico en Git es algo as&iacute;:

<ol>
<li>Modificas una serie de archivos en tu directorio de trabajo.</li>
<li>Preparas los archivos, añadiendolos a tu &aacute;rea de preparaci&oacute;n.</li>
<li>Confirmas los cambios, lo que toma los archivos tal y como est&aacute;n en el &aacute;rea de preparaci&oacute;n, y almacena esas instant&aacute;neas de manera permanente en tu directorio de Git.</li>
</ol>
</p>

<p>Si una versi&oacute;n concreta de un archivo est&aacute; en el directorio de Git, se considera confirmada (committed). Si ha sufrido cambios desde que se obtuvo del repositorio, pero ha sido añadida al &aacute;rea de preparaci&oacute;n, est&aacute; preparada (staged). Y si ha sufrido cambios desde que se obtuvo del repositorio, pero no se ha preparado, est&aacute; modificada (modified). En el Cap&iacute;tulo 2 aprender&aacute;s m&aacute;s acerca de estos estados, y de c&oacute;mo puedes aprovecharte de ellos o saltarte toda la parte de preparaci&oacute;n.</p>
</body>

</html>